{
  "pages": [
    {
      "text": "Name: Po-Jen Hsu / 許伯任\nEmail   clusterga@gmail.com\nTel     +886-952-335534\n\nPh.D Candidate, TIGP, IAMS, Academia Sinica (2008 - Now)\nResearch Assistant in Physics, National Central University (2005 - 2008)\nMilitary Service (2003 - 2005)\nM.S. in Physics, National Central University (2000 - 2003)\nB.S. in Physics, National Central University (1996 - 2000)\n\n\nPROJECT\nThe following softwares were developed by me and can be modified and distributed under GNU License (GPL).\n\nCLVAF\nVector Autocorrelation Function with GPGPU (OpenCL/C/C++)\nThe CLVAF uses the power of GPGPU to calculate the autocorrelation function of multi-dimensional vectors. I choosed OpenCL instead of CUDA for the best platform transferability. The OpenCL is supported by vast manufactures including Nvidia, AMD, Intel, ARM (Mobile devices), and so on, and is as efficient as CUDA. In the latest CUDA toolkit, the OpenCL is natively supported.\n\n\nMPITools\nMPICH Tools (Shell Script)\nThe MPITools has vast functionalities which allow users to construct and deploy the parallel computing in a minute. It's written in shell script to achieve the highest platform transferability.\n\n\nPTMBHGA\nParallel Tempering Multicanonical Basin-hopping Plus Genetic Algorithm (MPICH/Fortran)\nThe PTMBHGA is a combination of several state-of-art optimization techniques, including genetic algorithm, parallel tempering Monte Carlo, Simulating Annealing, Basing-Hopping, and Multicanonical Monte Carlo. The program was designed to be flexible for either a single run  or integration of any optimization technique. I gained most knowledge of optimization from this project.\n\n\nPTMD\nParallel Tempering Molecular Dynamics Simulation Plus Self Analyzers (MPICH/Fortran)\nThe PTMD is an implementation of the software engineering. It combines analyzer and numerical simulation so the program can analyze the results produced by the latter automatically. During the first and the second year of my Ph.D career, it produced and analyzed more than 10TB data without interruption. Most analyzers were designed for time series clustering and molecular shape analysis.\n\n\nDTools\nTools for Diffusion Theory (C/C++)\nThe Dtools helps researchers to reduce the tedious preparation of the diffusion theory calculation. This is one topic of my Ph.D thesis collaborated with Dr. Rapallo.\n\n\nTCOM\nVector Autocorrelation Function with MPICH (MPICH/Fortran)\nI designed TCOM to generate the vector autocorrelation function for diffusion theory. Later, I wrote CLVAF with GPGPU implemented.\nI also use matlab and python for light-weight computation.  in charge of construction and maintenance of PC clusters and web/mail servers in Prof. San-Kiong Lai's Lab.\n\n\n\n\nOTHER INFORMATION\nConstructor and maintainer of PC clusters and mail/web servers in Prof. San-Kiong Lai's Lab.\nBest Team Presentation Award, 4th Hope Meeting, 2012, Japan.\nMain speaker of Open Source in Physics in ICOS2009. (slides)\nChinese Translation of Phet Project in Physics.\n\nDavission-Germer Experiment\nStern-Gerlach Experiment\nQuantum Wave Interference\nQuantum Tunneling\nQuantum Bound States\nCovalent bonds\nBand Structure\n\n\n\n\n\n\n\nPUBLICATIONS\n\nPing-Han Tang, Ten-Ming Wu, P.J.Hsu, S.K. Lai, J. Chem. Phys. 137, 244304 (2012), \"Melting behavior of Ag14 cluster: An order parameter by instantaneous normal modes\"\nPing-Han Tang, Ten-Ming Wu, Tsung-Wen Yen, S.K. Lai, and P.J. Hsu, J. Chem. Phys. 135, 094302 (2011), “Comparative study of cluster Ag17Cu2 by instantaneous normal mode analysis and by isothermal Brownian-type molecular dynamics simulation\"\nS.K. Lai, Y. T. Lin, P. J. Hsu, and Siew Ann Cheong, Compt. Phys. Commun. 182, 1013 (2011), “Dynamical study of metallic clusters using the statistical method of time series clustering\"\nTsung-Wen Yen, P.J. Hsu, and S.K. Lai, e-J. Surf. Sci. Nanotech. 7, 149-156 (2009), “Melting behavior of noble-metal-based bimetallic clusters\"\nP.J. Hsu, J.S. Luo, S.K. Lai, J.F. Wax, and J-L Bretonnet, J. Chem. Phys. 129, 194302 (2008), “Melting scenario in metallic clusters\"\nP. J. Hsu and S. K. Lai, J. Chem. Phys. 124, 044711 (2006), “Structure of bimetallic clusters\"\n\nZhan, B. Piwowar, W.K. Liu, P. J. Hsu, S.K. Lai, and Jeff Z. Y. Chen, J. Chem. Phys. 120, 5536 (2004), “Multi-canonical basin-hopping: a new global optimization method for complex systems\"\n\n\nS.K. Lai, P.J. Hsu, K. L. Wu, W. K. Liu, and M. Iwamatsu, J. Chem. Phys. 117, 10715 (2002), “Structures of metallic clusters: mono- and polyvalent metals\"", 
      "tags": "", 
      "loc": "/stories/cv.html", 
      "title": "Curriculum Vitae (許伯任)"
    }
  ]
}